{
  "comments": [
    {
      "id": 1,
      "userId": 2,
      "content": "This is fascinating! My mom also gets migraines, and I often wonder about the genetic link. Could genetics also influence how strongly chocolate triggers my migraines? Thanks for the insight!",
      "timestamp": "2025-05-27T12:35:00Z",
      "likes": 15,
      "assist-summary": "<b>Jane Doe on MyBrain.com:</b> Jane Doe has been a member for three years and has an eight-year history of migraines. She consistently suspects chocolate as a trigger and experiences the unique symptom of scintillating scotoma without pain. <b>Key Activities & Interests:</b> Jane is actively trying to identify and manage her chocolate intake. She's sought advice on cutting it out, distinguishing between different types of chocolate, and finding alternative desserts. She's also tracking her food to confirm the connection. <b>Pain-Free Auras (Scintillating Scotoma):</b> Jane is highly interested in understanding her visual disturbances. She frequently discusses experiencing zigzagging, shimmering lights without subsequent migraine pain, seeking reassurance and information about this specific symptom. She's looking for ways to predict these auras and understand their significance. <b>Engagement:</b> Jane is an engaged forum participant, posting questions and seeking advice on both her suspected chocolate trigger and her unique aura experiences. She also utilizes articles on the site to better understand her condition.",
      "ai-suggest-comment": "<i>Jane, thanks for sharing! You're right, migraines often have a genetic link, and it's fascinating how diverse symptoms can be. Your pain-free scintillating scotoma and chocolate trigger could definitely have genetic components. We're seeing more research in these areas. Have you ever explored other neurological conditions in your family history for clues?</i>"
    },
    {
      "id": 2,
      "userId": 1,
      "content": "As someone who gets weather-triggered vestibular migraines, I can't help but wonder if we'll ever find a way to predict and prevent these episodes. The dizziness is sometimes worse than the headache itself. Anyone else feel the same way when the barometric pressure drops?",
      "timestamp": "2025-05-27T12:40:00Z",
      "likes": 12,
      "assist-summary": "<b>John Smith on MyBrain.com:</b> John has been a member for five years with a 12-year history of migraines. He primarily experiences weather-triggered vestibular migraines, with dizziness being a significant symptom. <b>Key Concerns:</b> John is particularly focused on understanding how barometric pressure changes affect his condition and is seeking ways to better manage the vestibular aspects of his migraines. He's actively engaged in discussions about weather-related triggers and vestibular migraine support.",
      "ai-suggest-comment": "<i>John, your experience with weather-triggered vestibular migraines is more common than many realize. The connection between barometric pressure and vestibular symptoms is an active area of research. Have you noticed any specific weather patterns that are particularly problematic for you? Some members find keeping a detailed weather journal helps them anticipate and manage their symptoms better.</i>"
    },
    {
      "id": 3,
      "userId": 4,
      "content": "This article really resonates with my experience. As someone who suffers from hormonal migraines, I've noticed they're almost perfectly synced with my cycle. The worst part for me is the cognitive fog that comes with my silent migraines - it's like my brain just stops working properly. Has anyone else found effective ways to manage these hormonal triggers? I've been tracking my cycle religiously, but I'm still searching for better ways to cope with the brain fog.",
      "timestamp": "2025-05-27T14:20:00Z",
      "likes": 18,
      "assist-summary": "<b>Emily Wilson on MyBrain.com:</b> Emily has been a member for 4 months and has a 2-year history of migraines. She primarily experiences hormonal migraines and silent migraines with cognitive fog. <b>Key Concerns:</b> Emily is particularly focused on understanding the connection between her menstrual cycle and migraine patterns. She's actively tracking her symptoms and seeking management strategies for both the physical and cognitive aspects of her migraines. <b>Engagement:</b> Emily is an active participant in women's health and silent migraine forums, sharing her experiences and seeking advice from others with similar conditions.",
      "ai-suggest-comment": "<i>Emily, thank you for sharing your experience with hormonal and silent migraines. The connection between hormonal fluctuations and migraine patterns is significant for many women. Your approach to tracking is excellent - have you noticed any specific patterns in your cognitive symptoms throughout your cycle? Some members find that certain dietary adjustments or stress management techniques during their luteal phase can help. Would you be interested in learning more about any particular management strategies?</i>"
    }
  ]
}